# Assignment 1
## Mike Johnson
### January 20, 2025

****

In [1]:
# Load sql extension
%load_ext sql

In [2]:
# Connect to housing.db
%sql sqlite:///housing.db

Connecting to 'sqlite:///housing.db'

#### 1. Return the first 7 records from the housing table

In [3]:
%%sql

SELECT *
FROM housing
LIMIT 7;

Running query in 'sqlite:///housing.db'

+-------+---------+------+-------+-------+----------+--------+----------+-----------+
| entry |   city  | year | month | sales |  volume  | median | listings | inventory |
+-------+---------+------+-------+-------+----------+--------+----------+-----------+
|   1   | Abilene | 2000 |   1   |   72  | 5380000  | 71400  |   701    |    6.3    |
|   2   | Abilene | 2000 |   2   |   98  | 6505000  | 58700  |   746    |    6.6    |
|   3   | Abilene | 2000 |   3   |  130  | 9285000  | 58100  |   784    |    6.8    |
|   4   | Abilene | 2000 |   4   |   98  | 9730000  | 68600  |   785    |    6.9    |
|   5   | Abilene | 2000 |   5   |  141  | 10590000 | 67300  |   794    |    6.8    |
|   6   | Abilene | 2000 |   6   |  156  | 13910000 | 66900  |   780    |    6.6    |
|   7   | Abilene | 2000 |   7   |  152  | 12635000 | 73500  |   742    |    6.2    |
+-------+---------+------+-------+-------+----------+--------+----------+-----------+

****

#### 2. How many records in the data had sales greater than 100 and a median sales price greater than 100000? Write a query to return the result.

In [4]:
%%sql

SELECT COUNT(*) AS 'Count'
FROM housing
WHERE
    sales > 100
    AND median > 100000;

Running query in 'sqlite:///housing.db'

+-------+
| Count |
+-------+
|  5106 |
+-------+

****

#### 3. Show the number of records in the data that had sales greater than 100 or a median sales price less than 100000 by month. The result should contain two columns: month and num_records.

In [5]:
# Adjust display limit
%config SqlMagic.displaylimit = None

displaylimit: Value None will be treated as 0 (no limit)

In [6]:
%%sql

SELECT
    month,
    COUNT(*) as num_records
FROM housing
WHERE
    sales > 100
    OR median < 100000
GROUP BY month

Running query in 'sqlite:///housing.db'

+-------+-------------+
| month | num_records |
+-------+-------------+
|   1   |     576     |
|   2   |     582     |
|   3   |     625     |
|   4   |     620     |
|   5   |     639     |
|   6   |     625     |
|   7   |     626     |
|   8   |     586     |
|   9   |     563     |
|   10  |     575     |
|   11  |     546     |
|   12  |     559     |
+-------+-------------+

****

#### 4. Return a result that shows the mean annual sales by city and year, excluding cities that begin with the letter H. The result should be in descending order by mean sales, limited to 20 records, and should contain three columns: city, year, and mean_annual_sales

In [7]:
%%sql

SELECT
    city,
    year,
    avg(sales) AS mean_annual_sales
FROM housing
WHERE city NOT LIKE "H%"
GROUP BY
    city,
    year
ORDER BY mean_annual_sales DESC
LIMIT 20;

Running query in 'sqlite:///housing.db'

+--------+------+--------------------+
|  city  | year | mean_annual_sales  |
+--------+------+--------------------+
| Dallas | 2006 | 5352.166666666667  |
| Dallas | 2015 | 5247.857142857143  |
| Dallas | 2014 | 5012.833333333333  |
| Dallas | 2005 | 4998.333333333333  |
| Dallas | 2013 | 4976.166666666667  |
| Dallas | 2007 | 4974.583333333333  |
| Dallas | 2004 | 4542.833333333333  |
| Dallas | 2008 | 4237.333333333333  |
| Dallas | 2012 | 4200.916666666667  |
| Dallas | 2003 |       4106.5       |
| Dallas | 2002 |      3933.25       |
| Dallas | 2001 |       3916.0       |
| Dallas | 2009 |      3824.25       |
| Dallas | 2000 | 3787.1666666666665 |
| Dallas | 2011 | 3554.6666666666665 |
| Dallas | 2010 | 3531.9166666666665 |
| Austin | 2015 | 2696.8571428571427 |
| Austin | 2014 | 2579.4166666666665 |
| Austin | 2013 | 2536.3333333333335 |
| Austin | 2006 | 2523.6666666666665 |
+--------+------+--------------------+

****

#### 5. How many sales were there in Austin in December 2010? Return the city, year, and sales in the result.

In [8]:
%%sql

SELECT
    city,
    year,
    sales
FROM housing
WHERE
    city = 'Austin'
    AND year = 2010
    AND month = 12;

Running query in 'sqlite:///housing.db'

+--------+------+-------+
|  city  | year | sales |
+--------+------+-------+
| Austin | 2010 |  1561 |
+--------+------+-------+

****

#### 6. In 2010 in Austin, which month had the most sales? Return a result that shows the number of sales in Austin in 2010 by month.

Return the month in 2010 that had the most sales in Austin.

In [9]:
%%sql

SELECT
    city,
    month,
    max(sales) AS max_sales
FROM housing
WHERE 
    city = 'Austin'
    AND year = 2010;

Running query in 'sqlite:///housing.db'

+--------+-------+-----------+
|  city  | month | max_sales |
+--------+-------+-----------+
| Austin |   5   |    2286   |
+--------+-------+-----------+

Return a result that shows the number of sales in Austin in 2010 by month.

In [10]:
%%sql

SELECT
    city,
    month,
    sales
FROM housing
WHERE 
    city = 'Austin'
    AND year = 2010
ORDER BY sales DESC;

Running query in 'sqlite:///housing.db'

+--------+-------+-------+
|  city  | month | sales |
+--------+-------+-------+
| Austin |   5   |  2286 |
| Austin |   4   |  2230 |
| Austin |   6   |  2190 |
| Austin |   3   |  1987 |
| Austin |   8   |  1675 |
| Austin |   7   |  1640 |
| Austin |   12  |  1561 |
| Austin |   9   |  1406 |
| Austin |   10  |  1336 |
| Austin |   11  |  1327 |
| Austin |   2   |  1249 |
| Austin |   1   |  985  |
+--------+-------+-------+

****

#### 7. In which city-month combinations did the greatest numbers of sales, outside of Austin? Return a result that contains the top five cities’ sales and the month it took place in 2010, excluding Austin.

In [11]:
%%sql

SELECT
    city,
    month,
    sales
FROM housing
WHERE
    city != 'Austin'
    AND year = 2010
ORDER BY sales DESC
LIMIT 5;

Running query in 'sqlite:///housing.db'

+---------+-------+-------+
|   city  | month | sales |
+---------+-------+-------+
| Houston |   5   |  6335 |
| Houston |   6   |  6117 |
| Houston |   4   |  5932 |
| Houston |   3   |  5389 |
|  Dallas |   5   |  4891 |
+---------+-------+-------+

****

#### 8. In which city, year, and month did the fewest sales take place? The result should return four columns: fewest_sales, city, year, and month

In [12]:
%%sql

SELECT
    min(sales) AS fewest_sales,
    city,
    year,
    month
FROM housing;

Running query in 'sqlite:///housing.db'

+--------------+------------+------+-------+
| fewest_sales |    city    | year | month |
+--------------+------------+------+-------+
|      6       | San Marcos | 2011 |   10  |
+--------------+------------+------+-------+

****

#### 9. For the entire dataset, what were the mean sales in each year?

In [13]:
%%sql

SELECT
    year,
    avg(sales) AS mean_sales
FROM housing
GROUP BY year;

Running query in 'sqlite:///housing.db'

+------+--------------------+
| year |     mean_sales     |
+------+--------------------+
| 2000 | 403.04891304347825 |
| 2001 | 419.29891304347825 |
| 2002 |       425.0        |
| 2003 | 459.9800724637681  |
| 2004 | 514.4909420289855  |
| 2005 | 572.5471014492754  |
| 2006 | 629.9510869565217  |
| 2007 |  593.661231884058  |
| 2008 | 501.2028985507246  |
| 2009 | 462.4166666666667  |
| 2010 | 440.2427536231884  |
| 2011 | 446.2971014492754  |
| 2012 | 520.0217391304348  |
| 2013 |  607.054347826087  |
| 2014 |  626.304347826087  |
| 2015 | 646.3478260869565  |
+------+--------------------+

****

#### 10. Return only the years that had mean sales greater than 600. Which years does this include?

In [14]:
%%sql

SELECT
    year
FROM housing
GROUP BY year
HAVING avg(sales) >600;

Running query in 'sqlite:///housing.db'

+------+
| year |
+------+
| 2006 |
| 2013 |
| 2014 |
| 2015 |
+------+

****